# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
import numpy as np
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [4]:
df.groupby("Company")

You can save this object as a new variable:

In [5]:
by_company = df.groupby("Company")

And then call aggregate methods off the object:

In [7]:
by_company.mean()

C:\Users\M\AppData\Local\Temp\ipykernel_12500\2992551274.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [8]:
by_company.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [9]:
by_company.std()

C:\Users\M\AppData\Local\Temp\ipykernel_12500\1358006188.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_company.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [11]:
by_company.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [12]:
by_company.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

agg method

In [18]:
by_company.agg([min,np.mean])

C:\Users\M\AppData\Local\Temp\ipykernel_12500\3677748779.py:1: FutureWarning: ['Person'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  by_company.agg([min,np.mean])

        Sales
          min   mean
Company
FB        243  296.5
GOOG      120  160.0
MSFT      124  232.0

In [28]:
by_company.agg([min,max])

          Person          Sales
             min      max   min  max
Company
FB          Carl    Sarah   243  350
GOOG     Charlie      Sam   120  200
MSFT         Amy  Vanessa   124  340

Your own function of interest:

In [8]:
def plus2(a):
    b = a.min()+2
    return b

In [9]:
by_company.agg([min,plus2])

C:\Users\M\AppData\Local\Temp\ipykernel_18368\1101699365.py:1: FutureWarning: ['Person'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  by_company.agg([min,plus2])

        Sales
          min plus2
Company
FB        243   245
GOOG      120   122
MSFT      124   126